In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import statistics
import math
import re

In [3]:
df_well_pollution = pd.read_excel("md_water_services_data.xlsx", sheet_name=0)
df_well_pollution.head()

,source_id,date,description,pollutant_ppm,biological,results
0,KiRu28935224,2021-01-04 09:17:00,Bacteria: Giardia Lamblia,0.000000,495.898000,Contaminated: Biological
1,AkLu01628224,2021-01-04 09:53:00,Bacteria: E. coli,0.000000,6.096080,Contaminated: Biological
2,HaZa21742224,2021-01-04 10:37:00,"Inorganic contaminants: Zinc, Zinc, Lead, Cadmium",2.715000,0.000000,Contaminated: Chemical
3,HaRu19725224,2021-01-04 11:04:00,Clean,0.028859,0.000096,Clean
4,SoRu35703224,2021-01-04 11:29:00,Bacteria: E. coli,0.000000,22.500900,Contaminated: Biological

In [6]:
df_water_source = pd.read_excel("md_water_services_data.xlsx", sheet_name=1)
df_water_source.head()

      source_id type_of_water_source  number_of_people_served
0  AkHa00000224          tap_in_home                      956
1  AkHa00001224   tap_in_home_broken                      930
2  AkHa00002224   tap_in_home_broken                      486
3  AkHa00003224                 well                      364
4  AkHa00004224   tap_in_home_broken                      942

In [7]:
df_visits = pd.read_excel("md_water_services_data.xlsx", sheet_name=2)
df_visits.head()

,record_id,location_id,source_id,time_of_record,visit_count,time_in_queue,assigned_employee_id
0,0,SoIl32582,SoIl32582224,2021-01-01 09:10:00,1,15,12
1,1,KiRu28935,KiRu28935224,2021-01-01 09:17:00,1,0,46
2,2,HaRu19752,HaRu19752224,2021-01-01 09:36:00,1,62,40
3,3,AkLu01628,AkLu01628224,2021-01-01 09:53:00,1,0,1
4,4,AkRu03357,AkRu03357224,2021-01-01 10:11:00,1,28,14

In [8]:
df_queue_composition = pd.read_excel("md_water_services_data.xlsx", sheet_name=3)
df_queue_composition.head()

   Unnamed: 0  record_id  percent_male  percent_female  percent_child
0           0      21896          4.78           87.50           7.72
1           1       9514         10.94           67.97          21.09
2           2      54843         10.00           75.38          14.62
3           3       2550          7.10           84.15           8.74
4           4      31721          5.79           72.73          21.49

In [9]:
df_project_progress = pd.read_excel("md_water_services_data.xlsx", sheet_name=4)
df_project_progress.head()

,project_id,source_id,address,town,province,source_type,improvement,source_status,date_of_completion,comments
0,1,SoIl32582224,36 Pwani Mchangani Road,Ilanga,Sokoto,river,Drill well,Backlog,NaN,NaN
1,2,KiRu28935224,129 Ziwa La Kioo Road,Rural,Kilimani,well,Install UV and RO filter,Backlog,NaN,NaN
2,3,HaRu19752224,18 Mlima Tazama Avenue,Rural,Hawassa,shared_tap,Install 2 taps nearby,Backlog,NaN,NaN
3,4,AkLu01628224,100 Mogadishu Road,Lusaka,Akatsi,well,Install UV and RO filter,Backlog,NaN,NaN
4,5,KiRu29315224,26 Bahari Ya Faraja Road,Rural,Kilimani,river,Drill well,Backlog,NaN,NaN

In [10]:
df_location = pd.read_excel("md_water_services_data.xlsx", sheet_name=5)
df_location.head()

  location_id               address province_name town_name location_type
0   AkHa00000    2 Addis Ababa Road        Akatsi    Harare         Urban
1   AkHa00001   10 Addis Ababa Road        Akatsi    Harare         Urban
2   AkHa00002    9 Addis Ababa Road        Akatsi    Harare         Urban
3   AkHa00003  139 Addis Ababa Road        Akatsi    Harare         Urban
4   AkHa00004   17 Addis Ababa Road        Akatsi    Harare         Urban

In [11]:
df_infrastructure_cost = pd.read_excel("md_water_services_data.xlsx", sheet_name=6)
df_infrastructure_cost.head()

                     improvement  unit_cost_USD
0                     Drill well           8500
1              Install RO filter           4200
2       Install UV and RO filter           3200
3  Diagnose local infrastructure            350
4          Install 1 taps nearby           2000

In [12]:
df_water_source_related_crime = pd.read_excel("md_water_services_data.xlsx", sheet_name=7)
df_water_source_related_crime.head()

,Unnamed: 0,crime_id,time_of_incident,loc_id,crime_type,victim_gender
0,0,C00014,2010-01-01 04:00:00,HaRu20242,harassment,F
1,1,C00027,2010-01-01 05:00:00,KiRu27539,public_intoxication,F
2,2,C00050,2010-01-01 06:00:00,SoRu37961,severe_assault,F
3,3,C00059,2010-01-01 06:00:00,KiRu25435,vandalism,F
4,4,C00066,2010-01-01 08:00:00,SoRu34723,theft,F

In [14]:
df_infrastructure_cost.head(12)

                      improvement  unit_cost_USD
0                      Drill well           8500
1               Install RO filter           4200
2        Install UV and RO filter           3200
3   Diagnose local infrastructure            350
4           Install 1 taps nearby           2000
5           Install 2 taps nearby           4000
6           Install 3 taps nearby           6000
7           Install 4 taps nearby           8000
8           Install 5 taps nearby          10000
9           Install 6 taps nearby          12000
10          Install 7 taps nearby          14000
11          Install 8 taps nearby          16000

In [15]:
df_cost = df_project_progress.merge(df_infrastructure_cost, how="left")
df_cost.head()

,project_id,source_id,address,town,province,source_type,improvement,source_status,date_of_completion,comments,unit_cost_USD
0,1,SoIl32582224,36 Pwani Mchangani Road,Ilanga,Sokoto,river,Drill well,Backlog,NaN,NaN,8500
1,2,KiRu28935224,129 Ziwa La Kioo Road,Rural,Kilimani,well,Install UV and RO filter,Backlog,NaN,NaN,3200
2,3,HaRu19752224,18 Mlima Tazama Avenue,Rural,Hawassa,shared_tap,Install 2 taps nearby,Backlog,NaN,NaN,4000
3,4,AkLu01628224,100 Mogadishu Road,Lusaka,Akatsi,well,Install UV and RO filter,Backlog,NaN,NaN,3200
4,5,KiRu29315224,26 Bahari Ya Faraja Road,Rural,Kilimani,river,Drill well,Backlog,NaN,NaN,8500

In [57]:
df_cost[df_cost["town"] == "Rural"].shape

(16060, 11)

In [62]:
df_location["location_id"].nunique()

39650

In [55]:
18994650 + 40270700 * 1.5

79400700.0

In [54]:
df_cost[(df_cost["town"] == "Rural") & ((
    df_cost["province"] == "Sokoto") | (df_cost["province"] == "Kilimani"))]\
    ["unit_cost_USD"].sum()

40270700

In [23]:
df_cost["source_status"].unique()

array(['Backlog'], dtype=object)

In [25]:
df_cost["source_id"].nunique()

25398

In [32]:
df_cost[df_cost["province"] == "Sokoto"].groupby("town").sum()["unit_cost_USD"].sort_values(ascending=False)

town
Rural      21383350
Ilanga      1768950
Majengo     1555550
Kofi        1394350
Bahari      1204700
Marang      1183900
Cheche       969000
Name: unit_cost_USD, dtype: int64

In [34]:
for i in list(df_cost["province"].unique()):
    a = df_cost[df_cost["province"] == i].groupby("town").sum()["unit_cost_USD"].sort_values(ascending=False)
    print(f"{i}\n{a}")

Sokoto
town
Rural      21383350
Ilanga      1768950
Majengo     1555550
Kofi        1394350
Bahari      1204700
Marang      1183900
Cheche       969000
Name: unit_cost_USD, dtype: int64
Kilimani
town
Rural      18887350
Zuri        3357400
Mrembo      2332650
Harare      1834050
Isiqalo     1786250
Amara       1607850
Name: unit_cost_USD, dtype: int64
Hawassa
town
Rural       11939550
Amina        1100050
Djenne        863200
Deka          827350
Zanzibar      773700
Yaounde       750350
Serowe        329350
Name: unit_cost_USD, dtype: int64
Akatsi
town
Rural       18336550
Lusaka       1540250
Kintampo     1188800
Harare       1121200
Name: unit_cost_USD, dtype: int64
Amanzi
town
Rural      4406950
Asmara     1722900
Amina      1286100
Dahabu     1251750
Bello       960300
Pwani       905500
Abidjan     691300
Name: unit_cost_USD, dtype: int64

In [40]:
for i in ["Isiqalo", "Djenne", "Bello", "Amina"]:
    a = df_cost[df_cost["town"] == i].groupby("improvement").sum()["unit_cost_USD"].sort_values(ascending=False)
    print(f"{i}\n{a}")

Isiqalo
improvement
Install UV and RO filter         611200
Install RO filter                579600
Drill well                       340000
Install 8 taps nearby            128000
Diagnose local infrastructure     37450
Install 7 taps nearby             28000
Install 3 taps nearby             24000
Install 6 taps nearby             12000
Install 1 taps nearby             10000
Install 2 taps nearby              8000
Install 4 taps nearby              8000
Name: unit_cost_USD, dtype: int64
Djenne
improvement
Install RO filter                365400
Install UV and RO filter         332800
Drill well                        59500
Install 8 taps nearby             48000
Diagnose local infrastructure     17500
Install 7 taps nearby             14000
Install 6 taps nearby             12000
Install 5 taps nearby             10000
Install 1 taps nearby              4000
Name: unit_cost_USD, dtype: int64
Bello
improvement
Install 8 taps nearby            224000
Install 7 taps nearby            182000
Drill well                       127500
Install 6 taps nearby             84000
Install 5 taps nearby             80000
Install 4 taps nearby             64000
Install RO filter                 58800
Diagnose local infrastructure     47600
Install UV and RO filter          38400
Install 1 taps nearby             26000
Install 2 taps nearby             16000
Install 3 taps nearby             12000
Name: unit_cost_USD, dtype: int64
Amina
improvement
Install RO filter                701400
Install UV and RO filter         630400
Drill well                       527000
Install 8 taps nearby            192000
Diagnose local infrastructure    161350
Install 7 taps nearby             42000
Install 6 taps nearby             36000
Install 1 taps nearby             30000
Install 4 taps nearby             24000
Install 2 taps nearby             20000
Install 3 taps nearby             12000
Install 5 taps nearby             10000
Name: unit_cost_USD, dtype: int64

In [46]:
d = {"Ak": (22186800/5993306), "Am": (11224800/5431826), "H": (16583550/3843810), "S": (29459800/5774434)}
print(d)

{'Ak': 3.7019301200372547, 'Am': 2.066487402210601, 'H': 4.314352166210089, 'S': 5.1017640863156455}

In [50]:
29805550 + 29459800

59265350

In [45]:
# temp = dict()
for i in list(df_cost["province"].unique()):
    a = df_cost[df_cost["province"] == i].groupby("province").sum()["unit_cost_USD"].sort_values(ascending=False)
    print(f"{i}\n{a}")

Sokoto
province
Sokoto    29459800
Name: unit_cost_USD, dtype: int64
Kilimani
province
Kilimani    29805550
Name: unit_cost_USD, dtype: int64
Hawassa
province
Hawassa    16583550
Name: unit_cost_USD, dtype: int64
Akatsi
province
Akatsi    22186800
Name: unit_cost_USD, dtype: int64
Amanzi
province
Amanzi    11224800
Name: unit_cost_USD, dtype: int64

In [44]:
delete = pd.read_csv("delete.csv")
# delete.head(10)
delete = delete.to_dict("list")
delete

{'province_name': ['Kilimani', 'Akatsi', 'Sokoto', 'Amanzi', 'Hawassa'],
 'Sum of number_of_people_served': [6584764,
  5993306,
  5774434,
  5431826,
  3843810]}

In [52]:
df_cost.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25398 entries, 0 to 25397
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   project_id          25398 non-null  int64
 1   source_id           25398 non-null  object
 2   address             25398 non-null  object
 3   town                25398 non-null  object
 4   province            25398 non-null  object
 5   source_type         25398 non-null  object
 6   improvement         25398 non-null  object
 7   source_status       25398 non-null  object
 8   date_of_completion  0 non-null      float64
 9   comments            0 non-null      float64
 10  unit_cost_USD       25398 non-null  int64
dtypes: float64(2), int64(2), object(7)
memory usage: 2.1+ MB

In [63]:
df_new = df_cost.merge(df_visits[["location_id", "source_id"]], how="left")
df_new.head()

,project_id,source_id,address,town,province,source_type,improvement,source_status,date_of_completion,comments,unit_cost_USD,location_id
0,1,SoIl32582224,36 Pwani Mchangani Road,Ilanga,Sokoto,river,Drill well,Backlog,NaN,NaN,8500,SoIl32582
1,2,KiRu28935224,129 Ziwa La Kioo Road,Rural,Kilimani,well,Install UV and RO filter,Backlog,NaN,NaN,3200,KiRu28935
2,3,HaRu19752224,18 Mlima Tazama Avenue,Rural,Hawassa,shared_tap,Install 2 taps nearby,Backlog,NaN,NaN,4000,HaRu19752
3,3,HaRu19752224,18 Mlima Tazama Avenue,Rural,Hawassa,shared_tap,Install 2 taps nearby,Backlog,NaN,NaN,4000,HaRu19752
4,3,HaRu19752224,18 Mlima Tazama Avenue,Rural,Hawassa,shared_tap,Install 2 taps nearby,Backlog,NaN,NaN,4000,HaRu19752

In [64]:
df_new.shape

(45894, 12)

In [65]:
df_cost.shape

(25398, 11)

In [66]:
df_new = df_new.drop_duplicates(keep="first")
df_new.shape

(25398, 12)

In [67]:
df_new = df_new.merge(df_location[["location_id", "location_type"]], how="left")
df_new.shape

(25398, 13)

In [68]:
df_new["real_budget"] = np.where(df_new["location_type"] == "Rural", df_new["unit_cost_USD"] * 1.5, df_new["unit_cost_USD"])
# df['new_col'] = np.where(condition, df['price'] * 1.5, df['price'] * 1.2)
df_new["real_budget"].head(10)

0     8500.0
1     4800.0
2     6000.0
3     3200.0
4    12750.0
5      525.0
6     4200.0
7    24000.0
8     4800.0
9     4200.0
Name: real_budget, dtype: float64

In [69]:
df_new[["location_type", "unit_cost_USD", "real_budget"]].head(10)

  location_type  unit_cost_USD  real_budget
0         Urban           8500       8500.0
1         Rural           3200       4800.0
2         Rural           4000       6000.0
3         Urban           3200       3200.0
4         Rural           8500      12750.0
5         Rural            350        525.0
6         Urban           4200       4200.0
7         Rural          16000      24000.0
8         Rural           3200       4800.0
9         Urban           4200       4200.0

In [70]:
8500 * 1.5

12750.0

In [71]:
df_new[(
    df_new["province"] == "Sokoto") | (df_new["province"] == "Kilimani")]\
    ["real_budget"].sum()

79400700.0

In [76]:
df_new[df_new["province"] == "Sokoto"].groupby("improvement").sum()["real_budget"].sort_values(ascending=False)

improvement
Drill well                       19796500.0
Install RO filter                 7066500.0
Install UV and RO filter          4692800.0
Install 8 taps nearby             3072000.0
Install 7 taps nearby             1596000.0
Install 6 taps nearby              822000.0
Install 4 taps nearby              752000.0
Install 5 taps nearby              715000.0
Install 1 taps nearby              571000.0
Install 3 taps nearby              438000.0
Diagnose local infrastructure      381675.0
Install 2 taps nearby              248000.0
Name: real_budget, dtype: float64

In [74]:
40151475.0 + 39249225.0 > 22553325.0 + 13428275.0 + 31355075.0

True

In [77]:
for i in list(df_new["province"].unique()):
    a = df_new[df_new["province"] == i].groupby("town").sum()["real_budget"].sort_values(ascending=False)
    print(f"{i}\n{a}")

Sokoto
town
Rural      32075025.0
Ilanga      1768950.0
Majengo     1555550.0
Kofi        1394350.0
Bahari      1204700.0
Marang      1183900.0
Cheche       969000.0
Name: real_budget, dtype: float64
Kilimani
town
Rural      28331025.0
Zuri        3357400.0
Mrembo      2332650.0
Harare      1834050.0
Isiqalo     1786250.0
Amara       1607850.0
Name: real_budget, dtype: float64
Hawassa
town
Rural       17909325.0
Amina        1100050.0
Djenne        863200.0
Deka          827350.0
Zanzibar      773700.0
Yaounde       750350.0
Serowe        329350.0
Name: real_budget, dtype: float64
Akatsi
town
Rural       27504825.0
Lusaka       1540250.0
Kintampo     1188800.0
Harare       1121200.0
Name: real_budget, dtype: float64
Amanzi
town
Rural      6610425.0
Asmara     1722900.0
Amina      1286100.0
Dahabu     1251750.0
Bello       960300.0
Pwani       905500.0
Abidjan     691300.0
Name: real_budget, dtype: float64

In [78]:
for i in ["Isiqalo", "Djenne", "Bello", "Amina"]:
    a = df_new[df_new["town"] == i].groupby("improvement").sum()["real_budget"].sort_values(ascending=False)
    print(f"{i}\n{a}")

Isiqalo
improvement
Install UV and RO filter         611200.0
Install RO filter                579600.0
Drill well                       340000.0
Install 8 taps nearby            128000.0
Diagnose local infrastructure     37450.0
Install 7 taps nearby             28000.0
Install 3 taps nearby             24000.0
Install 6 taps nearby             12000.0
Install 1 taps nearby             10000.0
Install 2 taps nearby              8000.0
Install 4 taps nearby              8000.0
Name: real_budget, dtype: float64
Djenne
improvement
Install RO filter                365400.0
Install UV and RO filter         332800.0
Drill well                        59500.0
Install 8 taps nearby             48000.0
Diagnose local infrastructure     17500.0
Install 7 taps nearby             14000.0
Install 6 taps nearby             12000.0
Install 5 taps nearby             10000.0
Install 1 taps nearby              4000.0
Name: real_budget, dtype: float64
Bello
improvement
Install 8 taps nearby            224000.0
Install 7 taps nearby            182000.0
Drill well                       127500.0
Install 6 taps nearby             84000.0
Install 5 taps nearby             80000.0
Install 4 taps nearby             64000.0
Install RO filter                 58800.0
Diagnose local infrastructure     47600.0
Install UV and RO filter          38400.0
Install 1 taps nearby             26000.0
Install 2 taps nearby             16000.0
Install 3 taps nearby             12000.0
Name: real_budget, dtype: float64
Amina
improvement
Install RO filter                701400.0
Install UV and RO filter         630400.0
Drill well                       527000.0
Install 8 taps nearby            192000.0
Diagnose local infrastructure    161350.0
Install 7 taps nearby             42000.0
Install 6 taps nearby             36000.0
Install 1 taps nearby             30000.0
Install 4 taps nearby             24000.0
Install 2 taps nearby             20000.0
Install 3 taps nearby             12000.0
Install 5 taps nearby             10000.0
Name: real_budget, dtype: float64

In [79]:
df_new.groupby("province").sum()["real_budget"]

province
Akatsi      31355075.0
Amanzi      13428275.0
Hawassa     22553325.0
Kilimani    39249225.0
Sokoto      40151475.0
Name: real_budget, dtype: float64

In [80]:
delete

{'province_name': ['Kilimani', 'Akatsi', 'Sokoto', 'Amanzi', 'Hawassa'],
 'Sum of number_of_people_served': [6584764,
  5993306,
  5774434,
  5431826,
  3843810]}

In [81]:
di = {"Ak": (31355075.0/5993306), "Am": (13428275.0/5431826), "H": (22553325.0/3843810), "S": (40151475.0/5774434)}
print(di)

{'Ak': 5.231682647273475, 'Am': 2.4721474877877165, 'H': 5.867440118007914, 'S': 6.95331784898745}

In [82]:
di_ = {"Ak": (31355075.0/3753366), "Am": (13428275.0/3196068), "H": (22553325.0/2690982), "S": (40151475.0/4001192)}
print(di_)

{'Ak': 8.353854913163278, 'Am': 4.201498528817284, 'H': 8.381076127599515, 'S': 10.034878356249838}